#โปรแกรมซึ่งรับชื่อ และปีเกิดของผู้ใช้โปรแกรมทางแป้นพิมพ์ โดยหากอายุที่ผู้ใช้ป้อนมีค่าตั้งแต่ 35 ปีขึ้นไป 
# ให้แสดงข้อความว่า "คุณแก่แล้ว..." หากไม่ถึงให้แสดงข้อความ "คุณยังไม่แก่..." ทางหน้าจอ

from datetime import datetime

print('------------------')
print('โปรเเกรมตรวจสอบวัยวุฒิ')
print('------------------')

your_name = input('ป้อนชื่อ :')
your_yearbon = input('ป้อนปีเกิด (พ.ศ.):')
print('-------------------------------------------------------------------------')

yor_age = (datetime.now().year + 543) - your_yearbon

if yor_age >= 35 :
  print( f'คุณ{your_name} เเก่เเล้วนะจ้ะ')
else :
  print( f'คุณ {your_name} อายุ {yor_age} ยังไม่เเก่น้ะจะ เเจ่มเลย...')

















