#โปรแกรมตรวจสอบรถว่าผ่านเกณฑ์ของการตรวจสอบค่าคาร์บอนไดซ์ออกไซน์หรือ
# โดยหากค่าคาร์บอนไดซ์ออกไซน์มีค่าเกินกว่า 678.55 ให้แสดงข้อความว่า “ไม่ผ่าน”  
# หากน้อยกว่า 678.55 ให้แสดงข้อความ “ผ่าน” โดยให้รับชื่อเจ้าของ ทะเบียนรถ 
#  และปริมาณก๊าซคาร์บอนไดซ์ออกไซน์ที่วัดได้ ทางแป้นพิมพ์

print('--------------------')
print('---ตรวจสอบสภาพรถ---')
print('--------------------')

car_owner = input('ป้อนฃื่อเจ้าของรถ :')
car_number = input('ป้อนทะเบี่ยนรถ :')
car_carbon = float(input('ป้อนปริมาณกาศคารฺบอนไดร์ออกไซน์ :'))
print('----------------------------------------------------')

if car_carbon > 678.55 :
  print('รถทะเบียน {car_numbar} ของคุณ {num_owner} ไม่ผ่านเกณฑ์')
else :
  print('รถทะเบียน {car_numbar} ของคุณ {num_owner} ผ่านเกณฑ์')

print('----------------')
print('ขอบคุณ')










