#โปรแกรมตรวจสอบข้อมูลสายรถเมล์ โดยที่
#หากผู้ใช้ป้อนสายรถเมล์ 57 แสดงข้อความ สาย  57 ไปปิ่นเกล้า บางขุนนนท์
#	หากผู้ใช้ป้อนสายรถเมล์ 3 แสดงข้อความ สาย  3 ไปสนามหลวง ลาดพร้าว
#	หากผู้ใช้ป้อนสายรถเมล์ 71 แสดงข้อความ สาย  71ไปหัวลำโพง เยาวราช
#	หากผู้ใช้ป้อนสายรถเมล์ 56 แสดงข้อความ สาย 56 ไปบางลำพู สะพานกรุงธน
#	หากผูใช้ป้อนสายรถเมล์ 539 แสดงข้อความ สาย  539 ไปอนุสวรีย์ชัย สามเสน
#	หากผู้ใช้ป้อนสายรถเมล์สายอื่นนอกจากนี้ แสดงข้อความ ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม

print('---------------------------------------')
print('โปรแกรมตรวจสอบข้อมูลสายรถเมล์')
print('---------------------------------------')

x = float(input('ป้อนสายรถเมย์ :'))


if x == 57 :
  print(f'สาย  57 ไปปิ่นเกล้า บางขุนนนท์')
elif x == 3 :
  print(f'สาย  3 ไปสนามหลวง ลาดพร้าว')
elif x == 71 :
  print(f'สาย  71ไปหัวลำโพง เยาวราช')
elif x ==56 :
  print(f'สาย 56 ไปบางลำพู สะพานกรุงธน')
elif x == 539 :
  print(f'สาย  539 ไปอนุสวรีย์ชัย สามเสน')

else:
  print(f'ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม')

print('***************************************')