# Assigmnent Opertor กำหนดค่า คือ เครืาองหมาย =
# การทำงาน = คือ เอาทางขวามาใส่ทางซ้าย
# ยกเว้นเสียว่า สิ่งที่อยู่ทางขวาทำทำงานใดๆ ให้ทำให้เสร็จ เเล้วเอามาใส่ทางซ้าย
# ตัวแปร (variable) =  ช้อมูล (data)/นิพจน์ (Expression)
# *** ตัวแปร ( variable ) คือ ชื่อที่ dev. ตั้งชื่อเอาไว่เก็บช้อมูล
# *** การใช้งานตัวแปร คือ เอาข้อมูลที่ใส่ในตัวแปร หรือ เอาข้อมูลที่เก็บไว้มาใช้

score = 20
fillname = 'สมชาย'
salary = input('ป้อนเงินเดือน')
sum = 20+30
print('------------------------')
#ตัวดำเนินการกำหนดค่าเเบบย่อ
num = 10  # num = num +10
num += 10
num *= 10
num /= 10
num %= 10
num //=10
print (num)
print ('-------------------------')

