  # โปรแกรมทายตัวเลข โดยมีการทำงานของโปรแกรมดังนี้
# - ให้ผู้ใช้ทายตัวเลขโดยการป้อนตัวเลขทางแป้นพิมพ์
# - โดยกรณีที่ตัวเลขที่ป้อนมีค่าเท่ากับ 59 ให้แสดงข้อความ “ยินดีด้วยคุณทายถูก”
# - แต่หากตัวเลขที่ป้อนมีค่ามากหรือน้อยกว่า 59 ให้แสดงข้อความ “คุณทายผิดตัวเลขที่ป้อนมากไป” หรือ “คุณทายผิดตัวเลขที่ป้อนน้อยไป” และให้ผู้ใช้ป้อนใหม่  
# โดยโปรแกรมจะวนให้ผู้ใช้ป้อนไปเรื่อยๆ จนกว่าจะทายถูก

print('--------------------------------------------')
print('โปรเเกรมทายตัวเลย')
print('--------------------------------------------')
x = 59
while True :
  number =int(input('ป้อนตัวเลข'))
  
  if number == x :
    print('คำตอบถูกต้อง!!!!')
    break

  elif number < x :
    print('คำตอบไม่ถูกต้อง คำตอบน้อยเกินไป')

  else  :
    print('คำตอบไม่ถูกต้อง คำตอบมากเกินไป')