# คำสั่งรับค่าข้อความ string ทางแป้นพิม ใช้ฟังก์ชั่น input()
#****ตัวแปร variable คือ ฃื่อที่ Dev ตั้งชื่อขึ้นมาเอง (ต้องเป็นไปตามกฏการตั่งชื่อ) เอาไว้เก็บข้อมูลขึ้นในโปรเเกรม

fullname = input("ป้อนชื่อ")
year_born = input('ป้อนปีเกิด พ.ศ.:')
print('--------')
print(f'สวัสดีคุณ {fullname}')
print(f'คุณเกิดในปี {year_born} ตอนนี้คุณอายุ {2568 - int(year_born)}')

print("----------------------------------------")
#ใช้ , 
print("สวัสดีคุณ",fullname,"ป้อนชื่อ")
print("คุณเกิดในปี" ,year_born, "ตอนนี้คุณอายุ",{2568 - int(year_born)})
print("--------------------------------------")
#ใช้ +
print("สวัสดีคุณ"+str(fullname)+"ป้อนชื่อ")
print("คุณเกิดในปี" + str(year_born) + "ตอนนี้คุณอายุ" +str (2568 - int(year_born)))
print('----------------------------------------------------------------------------------------------------')
#ใช้ format
print('สวัสดีคุณ {} คุณเกิดในปี พ.ศ.{} ตอนนี้คุณอายุ {} ปี '.format(fullname,year_born, 2568 -(int(year_born))))
