#controtflow/ control statment เเยกเป็น 2 กลุ่มเฃ่นกัน
#1. Selection/Decision เลือกทำ คือ ต้องพิศูจน์ตรวจสอบก่อนทำงานใดๆ 
# พิสูจน์ตราวจสอบครั้งเดียว จริงทำ เท็จไม่ทำ (if)
# พิสูจน์ตราวจสอบครั้งเดียว จริงทำ เท็จก็ทำ  (if-else)
# พิสูจน์ตราวจสอบหลายครั้ง              (if-elif-else)

#2. Loop/Iteration/Repetiton ทำซ้ำ คือ ทำงานเดิมๆ ซ้ำ เเยกเป็น 2 แบบ
# รู้จำนวนครั้งในการทำซ้ำ
# ไม่รู้จำนวนครั้งในการทำซ้ำ
# While, for
#**** สิง่ที่ต้องระวังในการทำซ้ำ คือ ต้องรู้จบ

# *** Statment ที่เกี่ยวกับ Control Flow คือ break , continue โดยเฉพาะ loop











